## Problem Statement

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                  'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                  'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                  'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']
                   })
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [3]:
df['FlightNumber'].iloc[1] = df['FlightNumber'].iloc[0] + 10
df['FlightNumber'].iloc[3] = df['FlightNumber'].iloc[2] + 10
df

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [5]:
## convertig fload datatype to int datatype 
df['FlightNumber'] = df['FlightNumber'].astype(int)
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [11]:
a=pd.DataFrame()
a[['From','To']] = df['From_To'].str.split("_",expand=True)
a

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [12]:
a['From'] = a['From'].str.capitalize()
a['To'] = a['To'].str.capitalize()
a

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [13]:
df.drop(columns=['From_To'],axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [15]:
df['From'] = a['From']
df['To'] = a['To']
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [16]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [17]:
## this is one way 
df.explode('RecentDelays',ignore_index=True)

   FlightNumber RecentDelays              Airline      From         To
0         10045           23               KLM(!)    London      Paris
1         10045           47               KLM(!)    London      Paris
2         10055          NaN    <Air France> (12)    Madrid      Milan
3         10065           24  (British Airways. )    London  Stockholm
4         10065           43  (British Airways. )    London  Stockholm
5         10065           87  (British Airways. )    London  Stockholm
6         10075           13       12. Air France  Budapest      Paris
7         10085           67          "Swiss Air"  Brussels     London
8         10085           32          "Swiss Air"  Brussels     London

In [18]:
## this is another way

list_col = 'RecentDelays'

r = pd.DataFrame({
      col:np.repeat(df[col].values, df[list_col].str.len())
      for col in df.columns.drop(list_col)}
    ).assign(**{list_col:np.concatenate(df[list_col].values)})[df.columns]

r

   FlightNumber  RecentDelays              Airline      From         To
0         10045          23.0               KLM(!)    London      Paris
1         10045          47.0               KLM(!)    London      Paris
2         10065          24.0  (British Airways. )    London  Stockholm
3         10065          43.0  (British Airways. )    London  Stockholm
4         10065          87.0  (British Airways. )    London  Stockholm
5         10075          13.0       12. Air France  Budapest      Paris
6         10085          67.0          "Swiss Air"  Brussels     London
7         10085          32.0          "Swiss Air"  Brussels     London

In [29]:
delays= pd.DataFrame(df['RecentDelays'].values.tolist())
delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [25]:
b=len(pd.DataFrame(df['RecentDelays'].values.tolist()).columns)
b

3

In [35]:
col={}
for i in range(b):
  Key = delays.columns[i]
  Value = 'delay_'+str(i+1)
  col[Key]=Value

col

{0: 'delay_1', 1: 'delay_2', 2: 'delay_3'}

In [36]:
delays.rename(columns=col,inplace=True)
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [38]:
df[['delay_1','delay_2','delay_3']]=delays[['delay_1','delay_2','delay_3']]
df

   FlightNumber  RecentDelays              Airline  ... delay_1 delay_2  delay_3
0         10045      [23, 47]               KLM(!)  ...    23.0    47.0      NaN
1         10055            []    <Air France> (12)  ...     NaN     NaN      NaN
2         10065  [24, 43, 87]  (British Airways. )  ...    24.0    43.0     87.0
3         10075          [13]       12. Air France  ...    13.0     NaN      NaN
4         10085      [67, 32]          "Swiss Air"  ...    67.0    32.0      NaN

[5 rows x 8 columns]

In [39]:
df.drop('RecentDelays',axis=1,inplace=True)
df

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0         10045               KLM(!)    London  ...    23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2         10065  (British Airways. )    London  ...    24.0     43.0     87.0
3         10075       12. Air France  Budapest  ...    13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]